# Short Introduction to Pandas

In [5]:
greetings = "Assalam-o-Alaikum!"
greetings

'Assalam-o-Alaikum!'

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation

In [7]:
#Series

s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# DataFrame

dates = pd.date_range("20130101", periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.190488  1.301842 -0.338081  0.362499
2013-01-02 -0.854232  0.562966 -2.423550 -0.418624
2013-01-03  2.177258 -0.867067  0.180473 -0.199292
2013-01-04 -0.565308  0.162623 -1.320582  1.397314
2013-01-05 -1.749972 -0.561789 -0.414482  3.005054
2013-01-06  0.430798 -0.357795  0.077219 -1.109967

In [10]:
# Dict of objects

df2 = pd.DataFrame({"A": 1, 
                    "B": pd.Timestamp("20130102"), 
                    "C": pd.Series(1, index = list(range(4)), dtype = "float"), 
                    "D": np.array([3] * 4, dtype = "int32"), 
                    "E": pd.Categorical(["test", "train", "test", "train"]), 
                    "F": "foo"})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [11]:
# dtypes
df2.dtypes

A             int64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

In [12]:
# View first five rows

df.head()

                   A         B         C         D
2013-01-01 -0.361383 -0.283350 -1.286169 -2.550690
2013-01-02 -0.540067 -0.623469  2.367039 -2.893196
2013-01-03  0.287097 -0.416650  0.103299 -0.531546
2013-01-04  0.432456  1.122569 -0.199089  0.443404
2013-01-05 -0.169547  0.149185  1.217965 -2.950534

In [11]:
# View last three rows

df.tail(3)

                   A         B         C         D
2013-01-04  1.099176 -0.958217  1.957947 -0.461459
2013-01-05  0.795457 -0.688877 -1.258515 -0.083760
2013-01-06 -0.936594 -0.701396  2.420975 -0.020839

In [12]:
# View index of DataFrame

df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
# View columns of DataFrame

df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
# View values of DataFrame

df.values

array([[ 1.60294075, -0.16212124, -0.30916653,  1.53223074],
       [ 1.01057564,  0.93953072, -1.46392515, -2.46748646],
       [ 1.45187236,  1.03723549, -0.15646629, -1.97570429],
       [ 1.09917633, -0.95821653,  1.95794669, -0.46145903],
       [ 0.79545711, -0.68887704, -1.25851492, -0.08375951],
       [-0.93659445, -0.70139645,  2.42097456, -0.02083946]])

In [15]:
# Statistics Summary

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.837238 -0.088974  0.198475 -0.579503
std    0.917710  0.874305  1.631277  1.452245
min   -0.936594 -0.958217 -1.463925 -2.467486
25%    0.849237 -0.698267 -1.021178 -1.597143
50%    1.054876 -0.425499 -0.232816 -0.272609
75%    1.363698  0.664118  1.429343 -0.036569
max    1.602941  1.037235  2.420975  1.532231

In [18]:
# Transposing the data

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.602941    1.010576    1.451872    1.099176    0.795457   -0.936594
B   -0.162121    0.939531    1.037235   -0.958217   -0.688877   -0.701396
C   -0.309167   -1.463925   -0.156466    1.957947   -1.258515    2.420975
D    1.532231   -2.467486   -1.975704   -0.461459   -0.083760   -0.020839

In [21]:
# Sorting by an axis

df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  1.532231 -0.309167 -0.162121  1.602941
2013-01-02 -2.467486 -1.463925  0.939531  1.010576
2013-01-03 -1.975704 -0.156466  1.037235  1.451872
2013-01-04 -0.461459  1.957947 -0.958217  1.099176
2013-01-05 -0.083760 -1.258515 -0.688877  0.795457
2013-01-06 -0.020839  2.420975 -0.701396 -0.936594

In [22]:
# Sort by Values

df.sort_values(by = "B")

                   A         B         C         D
2013-01-04  1.099176 -0.958217  1.957947 -0.461459
2013-01-06 -0.936594 -0.701396  2.420975 -0.020839
2013-01-05  0.795457 -0.688877 -1.258515 -0.083760
2013-01-01  1.602941 -0.162121 -0.309167  1.532231
2013-01-02  1.010576  0.939531 -1.463925 -2.467486
2013-01-03  1.451872  1.037235 -0.156466 -1.975704

## Selection by Column

In [23]:
# Select data of A

df["A"]

2013-01-01    1.602941
2013-01-02    1.010576
2013-01-03    1.451872
2013-01-04    1.099176
2013-01-05    0.795457
2013-01-06   -0.936594
Freq: D, Name: A, dtype: float64

In [24]:
# Slices the rows

df[0:3]

                   A         B         C         D
2013-01-01  1.602941 -0.162121 -0.309167  1.532231
2013-01-02  1.010576  0.939531 -1.463925 -2.467486
2013-01-03  1.451872  1.037235 -0.156466 -1.975704

In [25]:
# Slices the rows

df["20130102": "20130104"]

                   A         B         C         D
2013-01-02  1.010576  0.939531 -1.463925 -2.467486
2013-01-03  1.451872  1.037235 -0.156466 -1.975704
2013-01-04  1.099176 -0.958217  1.957947 -0.461459

In [26]:
# Cross Section

df.loc[dates[0]]

A    1.602941
B   -0.162121
C   -0.309167
D    1.532231
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
# multi-axis by label

df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.602941 -0.162121
2013-01-02  1.010576  0.939531
2013-01-03  1.451872  1.037235
2013-01-04  1.099176 -0.958217
2013-01-05  0.795457 -0.688877
2013-01-06 -0.936594 -0.701396

In [29]:
# Both endpoints included

df.loc[dates[1:4], ["A", "B"]]

                   A         B
2013-01-02  1.010576  0.939531
2013-01-03  1.451872  1.037235
2013-01-04  1.099176 -0.958217

In [30]:
# Reduction in dimension

df.loc["20130102", ["A", "B"]]

A    1.010576
B    0.939531
Name: 2013-01-02 00:00:00, dtype: float64

In [33]:
# Scalar Value

df.loc[dates[1], "C"]

-1.4639251460267215

## Selection by Rows

In [35]:
# Row 4 data

df.iloc[3]

A    1.099176
B   -0.958217
C    1.957947
D   -0.461459
Name: 2013-01-04 00:00:00, dtype: float64

In [13]:
# integer slicing

df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.432456  1.122569
2013-01-05 -0.169547  0.149185

In [14]:
# integer position

df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.540067  2.367039
2013-01-03  0.287097  0.103299
2013-01-05 -0.169547  1.217965

In [15]:
# slocing rows explicitly

df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.540067 -0.623469  2.367039 -2.893196
2013-01-03  0.287097 -0.416650  0.103299 -0.531546

In [16]:
# slicing columns explicitly

df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.283350 -1.286169
2013-01-02 -0.623469  2.367039
2013-01-03 -0.416650  0.103299
2013-01-04  1.122569 -0.199089
2013-01-05  0.149185  1.217965
2013-01-06  0.356963 -1.993503

In [17]:
# getting value explicitly

df.iloc[1, 1]

-0.6234691615164891

## Boolean Indexing

In [20]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.287097 -0.416650  0.103299 -0.531546
2013-01-04  0.432456  1.122569 -0.199089  0.443404
2013-01-06  1.121642  0.356963 -1.993503  1.043159

In [21]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN  2.367039       NaN
2013-01-03  0.287097       NaN  0.103299       NaN
2013-01-04  0.432456  1.122569       NaN  0.443404
2013-01-05       NaN  0.149185  1.217965       NaN
2013-01-06  1.121642  0.356963       NaN  1.043159

In [22]:
# isin method

df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.361383 -0.283350 -1.286169 -2.550690    one
2013-01-02 -0.540067 -0.623469  2.367039 -2.893196    one
2013-01-03  0.287097 -0.416650  0.103299 -0.531546    two
2013-01-04  0.432456  1.122569 -0.199089  0.443404  three
2013-01-05 -0.169547  0.149185  1.217965 -2.950534   four
2013-01-06  1.121642  0.356963 -1.993503  1.043159  three

In [23]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.287097 -0.416650  0.103299 -0.531546   two
2013-01-05 -0.169547  0.149185  1.217965 -2.950534  four

In [26]:
# Setting

s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [27]:
df["F"] = s1

In [29]:
df

                   A         B         C         D    F
2013-01-01 -0.361383 -0.283350 -1.286169 -2.550690  NaN
2013-01-02 -0.540067 -0.623469  2.367039 -2.893196  1.0
2013-01-03  0.287097 -0.416650  0.103299 -0.531546  2.0
2013-01-04  0.432456  1.122569 -0.199089  0.443404  3.0
2013-01-05 -0.169547  0.149185  1.217965 -2.950534  4.0
2013-01-06  1.121642  0.356963 -1.993503  1.043159  5.0

In [32]:
# Setting values by label
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.283350 -1.286169 -2.550690  NaN
2013-01-02 -0.540067 -0.623469  2.367039 -2.893196  1.0
2013-01-03  0.287097 -0.416650  0.103299 -0.531546  2.0
2013-01-04  0.432456  1.122569 -0.199089  0.443404  3.0
2013-01-05 -0.169547  0.149185  1.217965 -2.950534  4.0
2013-01-06  1.121642  0.356963 -1.993503  1.043159  5.0

In [34]:
# setting values by position
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.286169 -2.550690  NaN
2013-01-02 -0.540067 -0.623469  2.367039 -2.893196  1.0
2013-01-03  0.287097 -0.416650  0.103299 -0.531546  2.0
2013-01-04  0.432456  1.122569 -0.199089  0.443404  3.0
2013-01-05 -0.169547  0.149185  1.217965 -2.950534  4.0
2013-01-06  1.121642  0.356963 -1.993503  1.043159  5.0

In [35]:
# setting by assigning with a numpy array

df.loc[:, "D"] = np.array([5] * len(df))

In [36]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.286169  5  NaN
2013-01-02 -0.540067 -0.623469  2.367039  5  1.0
2013-01-03  0.287097 -0.416650  0.103299  5  2.0
2013-01-04  0.432456  1.122569 -0.199089  5  3.0
2013-01-05 -0.169547  0.149185  1.217965  5  4.0
2013-01-06  1.121642  0.356963 -1.993503  5  5.0

In [38]:
# where operation

df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.286169 -5  NaN
2013-01-02 -0.540067 -0.623469 -2.367039 -5 -1.0
2013-01-03 -0.287097 -0.416650 -0.103299 -5 -2.0
2013-01-04 -0.432456 -1.122569 -0.199089 -5 -3.0
2013-01-05 -0.169547 -0.149185 -1.217965 -5 -4.0
2013-01-06 -1.121642 -0.356963 -1.993503 -5 -5.0

## Missing data

In [39]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ["E"])
df1.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.286169  5  NaN  1.0
2013-01-02 -0.540067 -0.623469  2.367039  5  1.0  1.0
2013-01-03  0.287097 -0.416650  0.103299  5  2.0  NaN
2013-01-04  0.432456  1.122569 -0.199089  5  3.0  NaN

In [41]:
# drop missing data

df1.dropna(how = "any")

                   A         B         C  D    F    E
2013-01-02 -0.540067 -0.623469  2.367039  5  1.0  1.0

In [43]:
# filling missing data

df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.286169  5  5.0  1.0
2013-01-02 -0.540067 -0.623469  2.367039  5  1.0  1.0
2013-01-03  0.287097 -0.416650  0.103299  5  2.0  5.0
2013-01-04  0.432456  1.122569 -0.199089  5  3.0  5.0

In [44]:
# boolean mask

pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

In [45]:
df.mean()

A    0.188597
B    0.098100
C    0.034924
D    5.000000
F    3.000000
dtype: float64

In [5]:
df.mean(1)

2013-01-01    0.283943
2013-01-02   -0.783360
2013-01-03    0.322843
2013-01-04   -0.081488
2013-01-05    0.069703
2013-01-06   -0.239936
Freq: D, dtype: float64

In [8]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [9]:
df.sub(s, axis = "index")

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  1.177258 -1.867067 -0.819527 -1.199292
2013-01-04 -3.565308 -2.837377 -4.320582 -1.602686
2013-01-05 -6.749972 -5.561789 -5.414482 -1.994946
2013-01-06       NaN       NaN       NaN       NaN

## Apply

In [10]:
# Apply functions

df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.190488  1.301842 -0.338081  0.362499
2013-01-02 -1.044719  1.864809 -2.761631 -0.056125
2013-01-03  1.132539  0.997742 -2.581158 -0.255417
2013-01-04  0.567231  1.160365 -3.901740  1.141897
2013-01-05 -1.182741  0.598576 -4.316222  4.146951
2013-01-06 -0.751943  0.240781 -4.239003  3.036984

In [15]:
df.apply(lambda x: x.max() - x.min())

A    3.927230
B    2.168910
C    2.604023
D    4.115021
dtype: float64

In [18]:
df.apply(lambda x: x.max() - x.min(), axis = "index")

A    3.927230
B    2.168910
C    2.604023
D    4.115021
dtype: float64

## Histogramming

In [19]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    5
1    5
2    1
3    1
4    5
5    4
6    6
7    5
8    1
9    4
dtype: int32

In [21]:
# counting values
s.value_counts()

5    4
1    3
4    2
6    1
dtype: int64

## String Methods

In [22]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

In [24]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.145591 -0.679617 -0.157841 -0.776721
1  2.327955 -0.408063 -0.137517  0.238113
2  0.564218 -1.130827  0.178488  0.621618
3  2.229836  1.216621 -1.877361 -0.360135
4  0.398600 -0.877601  1.142665 -0.505134
5 -1.799921 -0.929386 -0.373441  1.135924
6 -0.606510  0.153874 -0.433094  0.590102
7 -1.270928  0.556117 -0.758514 -0.042889
8 -1.750627 -1.236519  1.246324 -0.927943
9  1.107226 -0.989577 -0.253406 -0.122007

In [25]:
## break into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.145591 -0.679617 -0.157841 -0.776721
 1  2.327955 -0.408063 -0.137517  0.238113
 2  0.564218 -1.130827  0.178488  0.621618,
           0         1         2         3
 3  2.229836  1.216621 -1.877361 -0.360135
 4  0.398600 -0.877601  1.142665 -0.505134
 5 -1.799921 -0.929386 -0.373441  1.135924
 6 -0.606510  0.153874 -0.433094  0.590102,
           0         1         2         3
 7 -1.270928  0.556117 -0.758514 -0.042889
 8 -1.750627 -1.236519  1.246324 -0.927943
 9  1.107226 -0.989577 -0.253406 -0.122007]

In [26]:
# concat

pd.concat(pieces)

          0         1         2         3
0  1.145591 -0.679617 -0.157841 -0.776721
1  2.327955 -0.408063 -0.137517  0.238113
2  0.564218 -1.130827  0.178488  0.621618
3  2.229836  1.216621 -1.877361 -0.360135
4  0.398600 -0.877601  1.142665 -0.505134
5 -1.799921 -0.929386 -0.373441  1.135924
6 -0.606510  0.153874 -0.433094  0.590102
7 -1.270928  0.556117 -0.758514 -0.042889
8 -1.750627 -1.236519  1.246324 -0.927943
9  1.107226 -0.989577 -0.253406 -0.122007

In [27]:
# Join

left  = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [28]:
left

   key  lval
0  foo     1
1  foo     2

In [29]:
right

   key  rval
0  foo     4
1  foo     5

In [35]:
pd.merge(left, right, on = "key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Append

In [38]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ["A", "B", "C", "D"])
df

          A         B         C         D
0 -0.773675 -0.568007  0.033256  1.424946
1  0.322691  1.713112 -2.117065  1.553356
2 -1.505575 -1.306142  0.063151 -0.053995
3  0.413351  0.090970 -0.015855 -0.053981
4 -1.689715 -0.066282 -0.329311  0.442349
5 -1.344957  0.639722  2.350793  1.205621
6 -1.625111  0.017341  1.637830 -0.134323
7 -0.490895  0.346944 -1.192483 -0.494886

In [40]:
s = df.iloc[3]
s

A    0.413351
B    0.090970
C   -0.015855
D   -0.053981
Name: 3, dtype: float64

In [41]:
df.append(s, ignore_index = True)

          A         B         C         D
0 -0.773675 -0.568007  0.033256  1.424946
1  0.322691  1.713112 -2.117065  1.553356
2 -1.505575 -1.306142  0.063151 -0.053995
3  0.413351  0.090970 -0.015855 -0.053981
4 -1.689715 -0.066282 -0.329311  0.442349
5 -1.344957  0.639722  2.350793  1.205621
6 -1.625111  0.017341  1.637830 -0.134323
7 -0.490895  0.346944 -1.192483 -0.494886
8  0.413351  0.090970 -0.015855 -0.053981